                // SetTimeout() and SetInterval()

// https://uk.javascript.info/settimeout-setinterval


// Що таке WebAPI?
// Що таке планування?

// функції :
// setTimeout - дозволяє виконувати певну дію через якийсь час(встановлений)
// serInterval - дозволяє виконувати цю ж дію з певним інтервалом

// 1. setTimeout приймає два параметри:

//     - перший параметр це колбек-function (обробник TimeHandler);
//     - другий параметр це число (час в мілісекундах), через скільки мілісекунд виконати перший параметр;

// це обробник для setTimeOut (перший параметр)
// function timeOutAction() {
//     console.log('Hello');
// }

// console.log('befor timeout');  // це виконається першим
// setTimeout(timeOutAction,1000);  // ця функція не зупинитть код нижче, вона має виконатись через 1000мсек піля after
// console.log('after timeout');  // ця виконається друга

// так відбувається тому що це Асинхронний код, він виконається лише після всього Синхронного коду. 
// Синхронний код це весь код який не є Асинхронним напевно)))


// 2. setInterval 

// let count = 0;
// function intervalHandler() {
//     console.log(++count);
// }

// console.log('before interval');  // це виконається першим
// setInterval(intervalHandler, 1000);  // ця функція виконається останньою, коли виконається весь Синхронний код і буде повторюватись кожні 1000мсек
// console.log('after interval');  // це виконається другим

// Якщо врахувати що в нас зараз одночасно прописані дві асинхронні функції, то послідовність буде така
// спершу виконається весь синхронний код (тобто всі наші консоль логи в глобальній обл.видимості)
// потім виконається функція setTimeOut бо вона перша в коді
// потім виконається фукція setInterval бо вона нижче по коду, і вона буде виконуватись кожну 1000мсек скільки їй заманеться (вона сама не зупиниться, буде працювати вічно поки відкрита вкладка)

// Чи можна відмінити дію setTimeout?

// і setTimeOut і setInterval повертають число, це як певний ідентифікатор,
// і є зворотня фукція clearTimeout() яка може припините те, що вказано в setTimeout але для того щоб її використати потрібно передати як параметр цей ідентифікатор
// можем зберегти саму функцію у змінну щоб перевірити

// function timeOutAction() {
//     console.log('Hello');
// }

// console.log('befor timeout');  // це виконається першим
// const timeoutId = setTimeout(timeOutAction,1000); // ця не виконається бо її зупинить clearTimeout
// console.log('after timeout');  // ця виконається друга

// clearTimeout(timeoutId) // ця виконається третя 
// - це функція щоб припинити setTimeout, приймає як параметр id setTimeout (це синхронний код)
// тобто коли ми запустимо цей шматок коду, то має виконатись все крім setTimeout, тому що виконається
// весь синхронний код (в т.ч. clearTimeout) який не дасть запуститись setTimeout-у


// Відповідно так само існує синхронна функція clearInterval() 
// яка припиняє те що вказано в setInterval, і так само їй потрібен параметр id

// let count = 0;
// function intervalHandler() {
//     console.log(++count);
// }

// console.log('before interval');  // це виконається першим
// const intervalId = setInterval(intervalHandler, 1000);  // ця функція виконається останньою, коли виконається весь Синхронний код і буде повторюватись кожні 1000мсек
// console.log('after interval');  // це виконається другим

// clearInterval(intervalId);  // якщо її запустити одразу то setInterval взагалі не запуститься, 
// а якщо запустити її наприклад в консолі під час виконання setInterval то clearInterval просто 
// перерве роботу setInterval в момент свого запуску.


// Отже дію можна запланувати (setTimeout, setInterval) 
// і можна її зупинити за допомогою дзеркальних функцій (clearTimeout, clearInterval)


// можна setInterval запустистити на певну кількість ітерацій за допомогою перевіки if у колбек функції:
// let count1 = 0;
// function intervalHandler() {
//     if(count1 === 5) {
//       return clearInterval(intervalId);  // це виконається після 5 setInterval-ів
//     }
//     console.log(++count1);
// }

// console.log('before interval');  // це виконається першим
// const intervalId = setInterval(intervalHandler, 1000);  // ця функція виконається останньою, 5 разів а потм зупиниться
// console.log('after interval');  // це виконається другим

// такими if-ами можна реалізловувати будь які умови, які повинні з'явитись черезз певний час.


// Приклад
// Зробимо кнопку, на яку треба натиснути щоб отримати знижку, і протягом 5 сек кнопка має зникнути

// обробник для setTimeout
// function deleteBtn() {
//     const discountBtn = document.querySelector('button');  // отримуємо кнопку DOM
//     discountBtn.remove();  // видаляємо кнопку
// }

// setTimeout(deleteBtn, 5000);  // запускаєм дію з видалення кнопки через 5 секунд



// // Завдання 1:
// // При нантисканні на кнопку перефарбувати її через 2 секунди (2000 мсек)

// const colorBtn = document.querySelector('.change-color-once');  // отримую кнопку
// // створюю обробник для отриманої кнопки
// function colorBtnHandler(e) {
//     // в обробнику виставляю setTimeout і прямо в ній прописую колбек-функцію зі зміни кольору через 2 сек
//     setTimeout(() => {e.target.style.color = 'red'}, 2000);
// }

// colorBtn.addEventListener('click', colorBtnHandler);  // навішую обробку на кнопку при кліку


// // Завдання 2:
// // Після натискання на кнопку змінювати її колір кожні 2 секунди рандомно

// // створюю функцію яка генерує випадкове число для кожного спектру кольору в форматі rgb і повертає їх
// function getRandomColor() {
//     const r = Math.floor(Math.random() * 256);
//     const g = Math.floor(Math.random() * 256);
//     const b = Math.floor(Math.random() * 256);
//     return `rgb(${r}, ${g}, ${b})`;
// }

// const colorBtnInterval = document.querySelector('.change-color-interval');  // отримую DOM елемент

// // обробник для кнопки
// function colorBtnIntervalHandler(e) {
//     // встановлюю інтервал в 2 сек (колір змінюватиметься кожні 2 сек)
//     setInterval(() => {
//         // кожні 2 сек в event.target(кнопці) змінюється колір який повертається з функії getRandomColor 
//         e.target.style.backgroundColor = getRandomColor();
//     }, 2000);
// }
// // навішую обробник події на кнопку при кліку
// colorBtnInterval.addEventListener('click', colorBtnIntervalHandler);



// рекурсивний (рекуррентний) setTimeout.

// рекурсивний setTimeout іноді кращий за setInterval
// Уявімо, що ти використовуєш setInterval, щоб кожні 2 секунди завантажувати дані з сервера.

// Проблема: Якщо сервер гальмує і відповідає 3 секунди, а інтервал спрацьовує кожні 2 секунди, 
// то твої запити почнуть "нашаровуватися" один на одного, як сніговий ком. Браузеру стане погано.

// Рішення — рекурсія: ми не ставимо жорсткий інтервал, а плануємо наступний крок тільки тоді, коли 
// попередній завершився.

// let timerId = setTimeout(function request() {
//     console.log("Роблю запит до сервера...");
    
//     // Коли запит виконано, плануємо наступний через 2 секунди
//     timerId = setTimeout(request, 2000); 
// }, 2000);


// Завдання 1
// Давай напишемо функцію-таймер. Вона має виводити в консоль числа від 5 до 1, з паузою в 1 
// секунду між ними, а в кінці написати "Бум! 💥".
// Твої інструменти:
// Змінна-лічильник (почни з 5).
// setInterval (щоб повторювати кожну секунду).
// clearInterval (щоб зупинитись, коли дійдеш до 0).
// Підказка: Не забудь зберегти ID інтервалу в змінну, щоб мати змогу його зупинити. 😉

// let count = 5;  // задаємо лічильник
// function timerHandler() {   // створюємо обробник для setInterval
//     if (count > 0) {  // якщо лічильник > 0
//         console.log(count); // спершу вивести count (щоб почати відлік з 5)
//         count--;  // а потім зменшити count, якщо написати навпаки то відлік почнеться з 4
//     } else {  // інакше
//         console.log('Boom!');  // вивести бум
//         clearInterval(timerId);  // відмінити setInterval
//     }

// }

// const timerId = setInterval(timerHandler, 1000)  // задаємо setInterval на кожні 1000мсек 
// // і зберігаємо в змінну щоб отримати id для clearInterval


// Наступний рівень: "Турбо-режим" 🏎️
// Уяви, що наш "таймер" працює занадто повільно, і ми хочемо додати кнопку "Прискорити".
// Завдання:
// Напиши код, де спочатку інтервал працює кожну 1 секунду. Але як тільки лічильник дійде до 3,
//  інтервал має зупинитися і перезапуститися вже кожні 200 мілісекунд (дуже швидко).
// Як це зробити (алгоритм):
// Створюєш перший setInterval на 1000 мс.
// Всередині обробника перевіряєш: if (count === 3).
// Якщо так — робиш clearInterval старого таймера.
// І тут же запускаєш новий setInterval(timerHandler, 200).
// Це покаже, як динамічно змінювати плани браузера на ходу! 🚀📈

// (Підказка: оскільки ти будеш викликати setInterval двічі, змінна timerId має бути доступною 
// для перезапису, тобто оголошеною через let зовні).


// let count = 8;
// let timerId;

// function timerHandler() {
//     if (count > 0) {   // якщо count більше 0 
//         console.log(count); // вивести count
//         count--; 
//         if (count === 3) {  // якщо count досяг 3 то вмикаєм пришвидщення
//             clearInterval(timerId);  // зупиняємо setInterval на 1000мсек
//             timerId = setInterval(timerHandler, 200);  // створюємо новий на 200мсек
//         }
//         count--;  // і лише після цього зменшуємо count
//         // якщо зменшити його як у прикладі то пришвидшення почнеться після того як 3 виведеться через 1000 мсек. виведеться 2 з якого почнеться інтервал по 200мсек
//         // якщо зменшити його перед if(count===3) то пришвидшення почнеться з 3, вона буде першим швидким числом
//         // також при ранььому декременті є імовірність що count не зможе увійти в if(count === 3) тому що число 3 заміниться на 2 перед тим як дійти до умови
//     } else {  // якщо count <= 0  то вивсети повідомл і зупинити setInterval
//         console.log('Boom!');
//         clearInterval(timerId);
//     }
// }

// timerId = setInterval(timerHandler,1000);  // створюємо перший таймер на повтор що 1000мсек



// Завдання "Світлофор"
// 🚦 Завдання: Алгоритм роботи світлофора
// Тобі потрібно написати код, який послідовно виводить у консоль кольори 
// світлофора з певними затримками.
// Умови виведення:
// "Червоний" — має з'явитися в консолі миттєво (синхронно).
// "Жовтий" — має з'явитися рівно через 2 секунди після того, як вивівся "Червоний".
// "Зелений" — має з'явитися рівно через 1 секунду після того, як вивівся "Жовтий".
// 💡 Два способи реалізації (спробуй обидва для практики):
// Спосіб А: "Матріошка" (Вкладені таймери)
// Ти ставиш перший setTimeout для Жовтого, а вже всередині його колбека прописуєш 
// другий setTimeout для Зеленого.
// Плюс: Час другого таймера почнеться тільки тоді, коли спрацює перший.
// Питання: Яку затримку (мс) треба поставити для Жовтого, а яку для Зеленого в цьому випадку?
// Спосіб Б: "Паралельний старт" (Плоский список)
// Ти пишеш обидва setTimeout один за одним у загальному потоці коду.
// Нюанс: Пам'ятай, що обидва таймери потраплять у Web API майже одночасно.
// Питання: Яку затримку (мс) треба вказати для Зеленого, щоб він з'явився через 1 секунду після 
// Жовтого, якщо Жовтий чекає 2000 мс?

// 1 спосіб матрьошка(Nested)
// console.log('red');  // спершу вивожу червоний

// function trafficLightTimer() {  // це callback для першого setTimeout
//     console.log('yellow');  // другим виведеться жовтий (через 2 сек після червоного)
//     setTimeout(()=>{console.log('green');}, 1000);  // це другий setTimeout який виведе зелений через 1 сек після жовтого
// }

// setTimeout(trafficLightTimer, 2000);  // перший setTimeout для виведення жовтого

// 2 спосіб Плоский список (Flat)

// console.log('red');  // першим виведем червоний

// setTimeout(()=>{console.log('yellow');}, 2000);  // через 2 сек після виведем жовтий
// setTimeout(()=>{console.log('green');}, 3000)  // щоб зелений вивівся третім треба сумувати час 
// 2 сек на жовтий + 1 сек на зелений разом 3 секунди з моменту потрапляння в WebAPI
// якщо рядки поміняти місцями (жовтий і зелений) результат не зміниться бо значення має саме час відкладки
// якщо для зеленого написати 1000 delay то першим виведеться зелений і лише потім жовтий


// Завдання: "Настирливий Будильник"
// Уяви, що ти створюєш додаток-будильник. Тобі потрібно реалізувати таку логіку:
// Початок: Як тільки ти запускаєш код, починає працювати setInterval, який кожну 1 
// секунду виводить у консоль: "Дзінь! 🔔".
// Час виходу: Ти розумієш, що не можеш слухати це вічно. Тому тобі треба запланувати 
// одноразову дію (setTimeout), яка спрацює рівно через 5 секунд.
// Фінал: Ця одноразова дія має:
// Зупинити набридливий setInterval (щоб він більше не дзвонив).
// Вивести в консоль: "Нарешті тиша... 🤫".
// Підказка (архітектурна):
// Тобі знадобляться дві змінні для зберігання ID обох таймерів (хоча для setTimeout ID може
//  й не знадобитися, якщо ти не плануєш його скасовувати, але для setInterval — обов'язково!).
// Спробуй написати цей код. Пам'ятай: один таймер працює "циклічно", а інший — чекає в 
// Web API 5 секунд, щоб потім "вбити" перший.


// let alarmId = setInterval(()=>{console.log('Дзінь');}, 1000);

// setTimeout(()=>{clearInterval(alarmId); console.log('Нарешті тиша');}, 5000);






// Практитка Stopwach

// start - запустити накопичення мсек
// reset - скинути накопичені мсек
// stop - зупинити накопичення мсек

// let time = new Date(0);  // через констурктор Date скидаємо час до 0
// // let time = 0;
// let intervalId = null;


// const timeEl = document.querySelector('.time');
// const [startBtn, stopBtn, resetBtn] = document.querySelectorAll('.btn-container > button');

// updTime(time);

// function startBtnHandler () {
//     const DELAY = 10;
//     function tick() {
//         time.setMilliseconds(time.getMilliseconds() + DELAY);
//         updTime(time);
//     }

//     if(!intervalId) {
//         intervalId = setInterval(tick, DELAY);
//     }
// }

// startBtn.onclick = startBtnHandler;

// function stopBtnHandler() {
//     clearInterval(intervalId);
//     intervalId = null;
// }

// stopBtn.onclick = stopBtnHandler;

// function resetBtnHandler() {
//     time = new Date(0);
//     updTime(time);
// }

// resetBtn.onclick = resetBtnHandler;

// function updTime(time) {
//     timeEl.textContent = `
//     ${formatMinutesAndSeconds(time.getMinutes())}
//     :
//     ${formatMinutesAndSeconds(time.getSeconds())}
//     .
//     ${formatMilliseconds(time.getMilliseconds())}
//     `;
// }

// // форматуємо час, якщо число з одної цифри додамо 0 : 5 => 05
// function formatMinutesAndSeconds(m) {
//     return m < 10 ? `0${m}` : m;
// }

// // форматуємо мсек, якщо число з одної цифри додамо 00 : 5 => 005
// // якщо число з двох цифр додамо 0 :  10 => 010
// function formatMilliseconds(ms) {
//     return ms < 100 ? (ms < 10 ? `00${ms}` : `0${ms}`) : ms;
// }


