//  JS Прототипна мова програмування- це стиль програмування при якому відсутнє поняття класу, а повторне використоання (успадкування) проводиться шляхом клонування наявного примірника ОБ'ЄКТА - прототипу.

// JS Об'єктно-орієнтоване програмування - одна з прадигм програмування, яка розглядає програму як мнодину об'єктів, що взаємодіють між собою. 
// Основу ООП складають чотири основні концепції (принципи) : інкапсуляція, успадкування, поліморфізм та абстракція.

// В інших високорівневих об'єктно-орієнтованих мовах програмування (С++, Java, C#...) все що у JS реалізується прототипами, те в інших реалізується Класами