                    // DOM (Модель об'єкта документа). (Document object Model)


    // DOM - обєктна модель документа, яка представляє весь вміст сторінки у вигляжі обєктів, які можна змінювати
    // Відповідно до DOM, кожен HTML-елемент є обєктом

    // JS викоується в браузерному оточенні, який в свою чергу складається з Window що є глобальним обєктом для JS(являє собою вікно браузера і має методи для керування ним) і складається з:
    // - DOM (Document Object Model)
    // - BOM (Browser Object Model) - в браузері навігатор, доступ до рядка з посиланням, кнопка назад/вперед, екран
    // - JS (Object, Array, Function...)

    // Основкний обєкт DOM через який реалізовано роботу з сторінкою це Document який знаходиться у Window (в консолі можна глянути)
    // для того щоб JS міг взаємодіяти з  сутностями на сторінці, потрібно отримати доступ до цих сутностей/елементів





                    // Доступ до елементів


// Для роботи з DOM використовують інтерфес Document
// document є властивістю глобального обєкта window, який в свою чергу теж складається з обєктів (document.head, document.body тощо)

    // console.log(document.body);  // отримаємо вміст body в поточному html документі
    // console.log(document);  // отримаємо вміст поточного html документа
    // console.log(document.head);  // отримаємо вміст head поточного html документа

// Можна ще обєкт document щоб переконатись що це дійсно обєкт можна вивести його в консоль за допомогою функції console.dir

// console.dir(document);  // отримаємо обєкт document з всіма властивостями та ланцюжком прототипів які теж містять властивості

// Щоб отримати всі інші оєкти DOM потрібно використовувати спеціальні методи за допомогою яких можна достукатися до елементів сторінки




// Завдання 1 : Пошук Елементів DOM
// 📄 HTML-структура для Практики
// 🎯 Ваші Завдання (JavaScript):
// Напишіть JS-вираз для виконання кожного завдання.
// Завдання 1: Прямий Доступ Отримайте посилання на елемент <body> за допомогою найшвидшого способу.
// Завдання 2: Пошук за ID Отримайте елемент <header> з ID main-header.
// Завдання 3: Універсальний Пошук (Один Елемент) Отримайте першу кнопку (<button>) з класом btn.
// Завдання 4: Універсальний Пошук (Колекція) Отримайте колекцію усіх елементів <p> з класом name.
// Завдання 5: Локальний Пошук Отримайте колекцію усіх карток (<div>) з класом active, 
// але шукайте їх лише всередині елемента content (спочатку отримайте content за ID, а потім шукайте всередині нього).


// const body = document.body;
// console.log(body);

// const mainHeader = document.getElementById('main-header');
// console.log(mainHeader);

// const btn = document.querySelector('.btn');
// console.log(btn);

// const parNames = document.querySelectorAll('p.name');
// console.log(parNames);

// const content = document.getElementById('content');
// console.log(content);
// const activeColl = content.querySelectorAll('div.active');
// console.log(activeColl);



// Завдання 2 : Комбінований Пошук та Колекції
// Уявіть, що у вас є таке меню та список завдань:
// Ваші Завдання (JavaScript):
// Визначте, який метод (та область пошуку) є найбільш доречним для кожного завдання,
// і зверніть увагу на тип колекції, який ви отримаєте.
// Завдання 1: Локальний Пошук (HTMLCollection) Отримайте всі елементи <li> (за тегом), 
// але шукайте їх лише всередині контейнера з ID tasks-container. Використовуйте метод, який повертає HTMLCollection.
// Завдання 2: Специфічний Пошук (NodeList) Отримайте колекцію усіх посилань (<a>),
// які мають одночасно класи nav-link та current.
// Завдання 3: Пошук Текстових Вузлів Отримайте всі дочірні вузли (включно з текстом і коментарями) 
// контейнера tasks-container (спочатку отримайте контейнер за ID). Яку властивість Node ви використаєте?
// Завдання 4: Пошук Першого Елемента Отримайте посилання, яке знаходиться між "Налаштування" та "Профіль". 
// Використовуйте універсальний селектор та властивість, що повертає лише один елемент.

// const tasksCont = document.getElementById('tasks-container');
// console.log(tasksCont);
// const listColl = tasksCont.getElementsByTagName('li');
// console.log(listColl);

// const body = document.body;
// const anch = body.querySelectorAll('a.nav-link.current');
// console.log(anch);


// const nodesColl = tasksCont.childNodes;
// console.log(nodesColl);
// // я використала властивість childNodes для навігації по DOM-дереву щоб отримати всі дочірні вузли
// // firstChild - щоб отримати перший дочірній вузол
// // next Sibling - щоб отримати наступний вузол на томуж рівні DOM-дерева

// const firstLink = body.querySelector('a');
// console.log(firstLink);