                // HTML Форми. Текстові інпути. (HTML Forms. Text inputs).

// https://w3schoolsua.github.io/html/html_forms.html#gsc.tab=0
// https://developer.mozilla.org/en-US/docs/Web/HTML/Reference/Elements/input
// https://developer.mozilla.org/en-US/docs/Learn_web_development/Extensions/Forms/Your_first_form

// HTML form - це розділ документа (тег <form>), що містить інтерактивні елементи управління, 
// які дозволяють користувачу відправляти інформацію на web-сервер.
// Тобто це специфічний пакувальник який може зібрати всю інформацію з нього в один пакет 
// і відправити на сервер

// Мінімальні атрибути які є у формі:
// form action - адреса сервера на якому буде відбуватися обробка інформації
// form get method - отримати з сервера дані (за замовчуванням)
// form post method - відправити на сервер дані (створити інформацію)

//  <form action="" method="post"></form> 

// Атрибут novalidate для форми - якщо додати його до тегу <form>, браузер вимкне всю автоматичну валідацію. 
// Це часто використовують розробники, коли хочуть написати власну красиву валідацію на JavaScript.

// Для того щоб форма заповнена данити змогла відправити їхї треба створити кнопку
// Якщо у середині форми <form> створюємо кнопку <button> то ця кнопка буде вважатися такою, яка призначена за відправлення форми
// Тобто в ній по замовчуванню буде атрибут type='submit' (за замовчуванням)

// Також кнопка форми може мати атрибут тип type='reset' - скидає всі дані введені в полях форми

// Чим можна заповнювати форму
// 1. Input - основне поле форми. 
// Має містити обовязково:
// атрибут type='' (за замовч. text), 
// атрибут name='firstName' - назва інпута

// Може містити такі атрибути:
// placeholder='' - текст який є підказвою/ прикладом в інпуті, його видно ДО того як почати вводити інфу
// value='' - значення яке буде запаковуватись в обєкт (ключ це name інпута, value це значення), 
// може використ для задання дефолтного значення
// autofocus - фокус на інпуті одразу після завантаження сторінки (булевий атрибут)
// required - обовязкове до заповнення поле (булевий атрибут) автоматична валідація щоб пусте поле не відправилось
// autocomplete - дозволити автоматичне заповнення поля (з історії браузера)
// pattern="" - можна прописати регулярний вираз Regexp але без // і без значків ^ $ від початку до кінця рядка (це вже 
// по замовчуванню мається на увазі), лише сам вираз. Він поводитиме валідацію на відповідність реглярному виразу 
// при натисканні кнопки submit
// minlength='' - мінімальна довжина рядка. Проводить валідацію на мін.кількість символів після натискання кнопки submit
// Атрибут pattern працює паралельно з minlength, що може призвести до помилки і форма не відправиться напр. Якщо minlength="5",
//  а pattern дозволяє 3 символи — форма не відправиться, бо не виконана умова minlength. Краще їх разом не використовувати 
// або бути дуже уважним з умовами
// maxlength='' - максимальна довжина рядка. Обмежує кількість введених символів (більше ніж вказано просто не вводиться в інпут)
// Взаємодія з атрибутом pattern така ж як і в minlength. Краще їх разом не використовувати або бути дуже уважним з умовами
// readonly — булевий атрибут - користувач не може змінити текст, але може його виділити/скопіювати, і дані відправляться на сервер.
// disabled — булевий атрибут - поле стає сірим, його не можна виділити, і дані НЕ відправляться на сервер.

// 2. label <label for=""></label> - додає до інпута назву опис/назву самого інпута
// Щоб він був зв'язаний з інпутом треба інпуту додати id і в label дописати атрибут for цей id
// або другий варіант прописати інпут в середині lable. Тоді при ннатисканні на опис інпута (текст в label)
// буде відмічатись відповідний інпут. Використовувати input без label це фуфуфуфу (поганий тон)

// 3. fieldset <fieldset></fieldset> - огортає всі елементи керування формою (інпути, кноки, тощо) додатковим
// блоком з рамочкою (тобто те що розміщено в середині тегу fieldset)

// 4. legend <legend></legend> - підпис для fieldset (як label для input) тільки legend пишемо всередині fieldset
// а label огортає зовні input або label пишеться на одному рівні з input і повязуються атртбутами for та id відповідно



// Саме до ТЕКСТОВИХ атрибутів input відносяться:
// placeholder='', pattern="", minlength='', maxlength=''


// Які можуть бути ТЕКСТОВІ атрибути type для input:
// 1. text - будьякий текст (по замовчуванню)
// 2. email - для ел.адреси, порводить просту валідацію якщо поле не порожнє(наявність хоча б одного символу до @ і після)
// Якщо поле порожнє і немає атрибута required, браузер пропустить форму.
// 3. password - приховує символи які вводяться як пароль (він не валідує пароль а лише приховує під час введення)
// 4. url - для посилання, проводить просту валідацію посилання якщо поле не порожнє(наявність http:// якихось символів і розширення)
// Якщо поле порожнє і немає атрибута required, браузер пропустить форму.
// 5. tel - звичайне поле для номеру телефону, не проводить ніяку валідацію, 
//  можна додати ще атрибут autocomplete для того щоб дозволии автоматисно підтягувати тел
// можна додати атрибут placeholder щоб показати в якому форматі вводити тел
// або додати атрибут value щоб задати початок телефону напр value ='+380' тоді користувачу треба буде 
// лише дописати оператора і свій номер. на мобільних пристроях type="tel" автоматично викликає цифрову 
// клавіатуру, що дуже зручно для користувача.
// 6. search - просте текстове поле яке при введені має дод.кнопочку Х щоб стерти те що введено в інпут

// Які можуть бути ЧИСЛОВІ атрибути type для input:
// 1. number - поле для введення числа чогось, має збоку стрілочки вверх-вниз щоб збільшувати чи зменшувати число
// класно щоб обрати кількість товару наприклад. За замовчуванням number дозволяє тільки цілі числа. Щоб дозволити 
// дроби (наприклад, ціну 10.50), треба додати step="0.01".
// 2. range - поле з повзунком який можна перетягувати вперед-азад щоб збільшувати чи зменшувати число
// класно щоб обирати гучність наприклад чи діапазон цін наприклад. Проблема range в тому, що він не має 
// вказівників ззовні (початок, максимум, мінімум тощо) тому їх потрібно додатково впихувати span-ами чи div-ами

// Числові типи атрибутів можуть містити такі дод атрибути:
// min='' - мінімальне значення числового інпута (валідацію проводить після натисканн кнопки submit, 
// але не дасть переклацати стрілочками менше ніж значення - не забороняє ручний ввід але після 
// натискання submit видасть помилку). По замовчуванню стоїть діапазон від 0 до 100
// max='' - максимальне значення числового інпута (валідацію проводить після натисканн кнопки submit, 
// але не дасть переклацати стрілочками більше ніж значення - не забороняє ручний ввід але після
//  натискання submit видасть помилку). По замовчуванню стоїть діапазон від 0 до 100
// step='' - дозволяє задати крок на яке число збільшиться чи зменшиться число після натискання стрілочок. Наприклад якщо 
// min='0' а step='2' то збільшення буде на 2 (тобто 0, 2, 4, 6, 8) а якщо ввести вручну в поле 3 або 7 то при 
// натисканні на submit викине помилку 

// Які можуть бути атрибути для ДАТИ type для input:
// 1. date - для чистої дати (місяць, день, рік) і має календарик для зручності вибору, + можна вводити вручну
// 2. datetime-local - змішаний формат дати і часу (для локалі - за браузером). Має календарик для зручного вибору дати та встановленн часу
// 3. time -  для чистого часу. Має годинничок для зручного встановлення годин та хвилин
// 4. month - для введення місяця(словами) і року. Має календарик для зручного вводу 
// 5. week - для введення тиждня і року. Має календарик для зручного вводу і вибору по даті, сам знає як рахувати тиждень

// Типи атрибутів для ДАТИ можуть містити такі дод атрибути:
// min='' - мінімальна дата яку може ввести користувач (записується як стрінг у форматі РРРР-ММ-ДД). Валідація відбуваєтьс після натискання на submit
// max='' - максимальна дата яку може ввести користувач (записується як стрінг у форматі РРРР-ММ-ДД). Валідація відбуваєтьс після натискання на submit
// step='' - крок (наприклад кожні 4 роки)

// Input щоб додати файл (як скрепочка в пошті, або додаємо фотку на аватарку) використ input type='file'
// На екрані отримаємо кнопку "Вибрати файл", обираємо локально з компа, коли обрали з'явиться назва файла
// обрати дозволить лише один файл не більше!
// multiple - дод.атрибут до input type='file' щоб можна було обрати кілька файлів, на кнопці зміниться напис "Вибрати файли"
// він дозволить за раз обрати кілька файликів, після вибору буде писати загальну кількість файликів
// accept – дод. атрибут для type="file" можна обмежити типи файлів: accept="image/*" (тільки картинки) або accept=".pdf".


// Input щоб обрати колір (палітра де в режимі RGB/HEX/HSL можна вибрати колір для чогось)
// На екрані буде спеціальна кнопка при натисканні якої вилізе палітра

// Input НЕВИДИМИЙ
// на екрані він не показується, label-ом огортати його не потрібно через те що його не видно
// type hidden використовується для відправки на сервер інформації разом з іншими полями (використ для
// передачі технічних ID, для безпеки CSRF токени для захисту від хакерських атак, для збереження стану
// наприклад якщо є багатосторінкова форма (тест чи опитування) на другій сторінці можна заховати дані що
// були введені на першій і в кінці відправити все одним махом)
// АЛЕ ніколи не клади в hidden поле конфіденційні дані, такі як паролі, номери кредитних карток або 
// суму до сплати, яку користувач не має права змінювати (адже він може змінити value="100" на value="1" 
// через консоль і спробувати обманути систему!).

// Інпути-кнопки (устарівший варіант, button більш рекомендований)
// Input type "button" -  за допомогою інпута можна робити саму звичайну кнопку. Назву кнопки вказуємо у value
// не перезавантажує сторінку
// Input type "image" -  за допомогою інпута можна робити саму звичайну кнопку з іконкою чи малюнком замість надпису 
// (атриб src та alt). Назву кнопки вказуємо у value. Вона працює як кнопка на submit і перезавантажує сторінку
// Input type "submit" - працює за тим самим принципм що й button type="submit" лише назву кнопки потрібно прописати 
// в атрибуті value
// Input type "reset" - працює за тим самим принципм що й button type="reset" лише назву кнопки потрібно прописати 
// в атрибуті value

// Корім стандартних інпутів є ще радіо-button, чек-бокс, текст-ареа та селекти
// 1. radio - надає можливість обирати один варіант із запропонованих (схоже на select)
// для реалізації використовуємо input type ='radio', обовязково кожн інпут огортаємо в label,
// вказуємо value (назва value має відповідати обраному варіанту, відображати його суть і буде запакований 
// при відправці на сервер як пара ключ значення обєкту: напр ключ/значення name gender / value male )
// Якщо в нас декілька варіантів на вибір і нам потрібно обрати лише один то кожен input з цього пакету
// повинен мати однаковий атрибут name - це автоматично звяже їх в одну групу і не дозволить обирати кілька
// опцій одночасно, інакше можна буде обрати всі або будь які) 
// Щоб встановити один з варіантів відмічений по замовчуванню то його input-у треба проставити 
// булевий атрибут checked. Без цього атрибута не буде обрано нічого при завантаженні форми.

// 2. checkbox - надає можливість обрати один або кілька варіантів із запропонованих
// для реалізації використовуємо input type="checkbox", обовязково кожен інпут огортаємо в label,
// вказуємо value (назва value має відповідати обраному варіанту, відображати його суть і буде запакований 
// при відправці на сервер як пара ключ значення обєкту: напр ключ/значення name prefs / value cars )
// Для групування коден input з тих що має входити в групу має мати однаковий атрибут name - це автоматично зв'яже 
// їх в одну групу (бо потім всі обрані значення будуть запаковані в масив як значеення ключа prefs).
// Якщо хочемо один з варіантів мати відміченим по замовчуванню то цьому input-у прописуємо булевий атрибут
// checked. Без цього атрибута жоден з варіантів не буде обраним при завантаженні форми

// 3. select - надає можливість обрати один з запропонованих варіантів за допомогою випадаючого списку
// для реалізації використ. <select name=""> обовязково огортаємо select в label або fieldset+legend для 
// опису групи опцій. Кожна опція групи select це окремий вкладений тег <option> з атрибутом value для запаковки в обєкт
// обрати можна лише один option. Щоб встановити якісь опцію за замовчуваннм дописуємо до option булевий 
// атрибут selected (опція  атрибутом selected буде перша в випадаючому списку коли список згорнутий незалежно 
// від того в якому порядку прописаний html)
// Також за допомогою тегу <optgroup label=”значення”> можна погрупувати на підгрупи опції в select

// 4. textarea - спеціальне поле що дає можливість вводити багаторядкові тексти (коментарі, відгуки, тощо). Може містити необмежену кількість символів
// текст відображаєтся шрифтом фіксованої ширини. Розмір текстового поля визначається CSS або атрибутами cols або rows
// Атрибут name потрібен для посилання на дані форми після її віідправки, якщо пропустити атрибут name дані з текстової області
// не надсилатимуться. Для доступності рекомендовано огортати textarea в тег label. Важливий нюанс: на відміну від input, де дефолтний текст пишеться в
//  атрибуті value, у textarea початковий текст пишеться між тегами: <textarea>Мій текст</textarea>.

