                // Принципи ООП (OOP principles)

// Повернись до класів JS - ці дві теми прямо повязані!

// Обєктно-орієнтоване програмування - одна з парадигм прогамування, яка розглядає програму як множину обєктів, що взаємодіють між собою
// Коли ми говоримо про ООП то в першу чергу згадуємо роботу з класами та Сеттери з Геттерами, але насправді там ще є нюанси
// Основу ООП склаадють чотири основні концепції (принципи): інкапсуляція, поліморфізм, успадкування та абстракція
// Інколи можна зустріти лище три концепції без абстракції - тому що абстракція сама по собі є в принципах, тому що коли ми говоримо про ООП це оззначає що в нас не просто присутні примітиви (10, 5 чи рядок з іменем) а в нас є цілий тип даних в якому ми зібрали ці примітиви, тобто ми від самого простого ідемо до якогось складного обєкту де купа різної інформації про нього зберігається, оце по суті і є абстракція, підвищується рівень абстракції


// Розглянемо три основні принципи ООП (три кити ООП), що воно таке і що воно означає:
// 1. Інкапсуляція - приховування логіки (особливосте реалізації)

            // приклад інкапсуляції

            class User {
                constructor (fullName) {
                    [this._firstName, this._lastName] = fullName.split(' '); // за допомогою деструктуризації розділяємо вхідний стрінг на масив з імені та прізвища
                    // this._firstName - "_" в назві властивості означає, що дана властивість є "захищеною" (protected) або "приватною" (private), тобто вона призначена для внутрішнього використання всередині класу і не повинна бути доступна або змінюватися напряму ззовні об'єкта.
                    //Це допомагає дотримуватися принципу інкапсуляції, приховуючи внутрішні деталі реалізації класу. Замість прямого доступу до _firstName, розробник мав би використовувати геттери (getFirstName()) або сеттери (setFirstName(name)), які дозволяють класу контролювати, як ця інформація читається або змінюється (наприклад, додавати валідацію).
                }
                set fullName(v) {
                    [this._firstName, this._lastName] = v.split(' ');
                }
                get fullName() {
                    return this._firstName + ' ' + this._lastName;
                }
            }

            const user = new User('Test Testovych');
            console.log(user);
                    // User {firstname: 'Test', lastName: 'Testovych'}
                    // firstname: "Test"
                    // lastName: "Testovych"

            user.fullName = 'Ivo Bobul';  // через set ми можемо задати інше значення по тому ж принципу, прийняти рядок, розділити і зберігати два окремі значення
            console.log(user);
            console.log(user.fullName);  // через get ми звертаємось до класу щоб отримати fullName і ми його отримуємо знову зконкатинованим в один рядочок

            // Суть в тому, що ззовні виглядає так, наче я працюю з рядком, а зсередини в мене все в класі зберігється поокремо, тобто працює не так як виглядає
            // тобто не важливо що і як я роблю з даними в середині в реальності, важливо який я даю інтерфейс, через які властивості чи методи я можу працювати з класом. 
            // тобто приховування деталей реалізації під певним інтерфейсом - від способів користування цим класом
            // Головне що я значю що я маю прийняти стрінг і повернути стрінг (тобто важливий інтерфейс класу)
            // Інтерфейс класу -  це набір властивостей та методів які ми можемо використовувати

            // Ще цікавий момент інкапсуляції, що навіть якщо ми зараз змінимо щось в класі(конструкторі) то це не  повпливає на зовнішній інтерфейс, тобто ми всерівно все налаштуємо так щоб отримати і повернути стрінг

// 2. Успадкування/Спадкування/Наслідування - перевикористання структури та логіки
// 3. Поліморфізм - можливість через однаковий інтерфейс