
                // Регулярні вирази (RegExp)

// Почитати:
// https://uk.javascript.info/regular-expressions
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Guide/Regular_expressions

// Табличка з усіма позначками регулярних виразів
// https://cheatography.com/davechild/cheat-sheets/regular-expressions/

// Посилання на погратись (візуалізатори ):
// https://regex101.com/
// https://regexper.com/
// https://regexr.com/
// https://ihateregex.io/

// RegExp - це спеціального виду обєкт new RegExp(конструктор) який дозволяє виконувати пошук за 
// значенням створюючи складні шаблони та вирази (наприклад для валідації email, пошуку в рядку, тощо)
// тобто це шаблон за допомогою якого ми можемо перевіряти ич відповідає рядок шаблону чи ні

// RegExp також використовуються в деяких методах  обєкта RegExp : exec, test
// RegExp також використовуються в деяких методах String : match, replace, search, split, matchAll

// Метод RegExp.test() - для перевірки наявності збігів (повертає true/false)
// Метод RegExp.exec() - для пошуку збігів (повертає масив або null)

// Метод String.match(regexp) - для пошуку збігів (повертає масив або null) - з прапорцем /g працює як matchAll()
// Метод String.replace(regexp, replacement) - для заміни збігів на новий рядок (повертає рядок змінений чи ні якщо нема збігів) 
// Метод String.search(regexp) - для пошуку індексу першого збігу (повертає індекс збігу або -1) ???????????
// Метод String.split(regexp) - для розбивки рядка на масив за роздільником-збігом (повертає масив або null) ???????????
// Метод String.matchAll(regexp) - для пошуку збігів (повертає масив або null)


// Створити регулярний вираз можна 2 способами:
// 1. Літерально, де перша частина це вираз який ми шукаємо, другий після другого / це прапорці
// в цей спосіб неможна вписати назву змінної ніяк (для динамічного вирикористання)
// const regExp1 = /expression/flags;
// const regExp12 = /qwerty/;

// 2. за допомогою конструктора new RegExp, де перший парам це вираз який ми шукаємо, другий - прапорці
// в цей спосіб можна вписати назву змінної використавши шаблонний літерал `${}` (для динамічного використання)

// const regExp2 = new RegExp(expression, flags);
// const regExp22 = new RegExp('qwerty');

// Методи щоб перевірити чи відповідає рядок вказаному виразу
// console.log(regExp22.test('eeeqwertyjdnvlkvnlvnflvlf'));  // true або false

// console.log('cdnjvnqwertylldlld'.match(regExp22));  // ['qwerty', index: 6, input: 'cdnjvnqwertylldlld', groups: undefined] або null

// Прапорці - це спец.позначки які впливають на пошук. Вказуються в кінці регулярного виразу після останнього "/"
// і - З цим прапорцем пошук не залежить від регістру: немає різниці між A та a (див. приклад нижче).
// g - З цим прапорцем пошук шукає всі збіги, без нього – лише перший.
// m - Багаторядковий режим (розглядається в розділі Багаторядковий режим якорів ^ $, прапорець "m").
// s - Вмикає режим “dotall”, при якому крапка . може відповідати символу нового рядка \n (розглядається у розділі Символьні класи).
// u - Вмикає повну підтримку Юнікоду. Цей прапорець дозволяє коректну обробку сурогатних пар (докладніше про це у розділі Юнікод: прапорець "u" та клас \p{...}).
// y - Режим пошуку на конкретній позиції в тексті (описаний у розділі Липкий прапорець "y", пошук на заданій позиції)

// Прапорці приклади
// const regExp13 = /qwerty/i;  //
// console.log(regExp13.test('55QweRtY99ffg')); // true - регістр не має значення з прапорцем /i

// const regExp14 = /qwerty/g;
// console.log('qwerty555qwerty444'.match(regExp14));  // (2) ['qwerty', 'qwerty']  - пошук усіх співпадінь, не лише першого

// Межі
// ^ - початок рядка
// $ - кінець рядка
// \b - границя слова
// \B - не границя слова (для заперечення використ той самий символ що і для границі слова тільки у верхньому регістрі)

// Перевірити, що qwerty є всім рядком і крім нього в рядку більше нічого нема
// console.log('qwerty'.match(/^qwerty$/));  //['qwerty', index: 0, input: 'qwerty', groups: undefined]
// console.log('11qwerty55'.match(/^qwerty$/));  //null

// Перевірити, чи стоїть qwerty на початку рядка ігноруючи регістр
// console.log('qweRtyPPP55'.match(/^qwerty/i));  // ['qweRty', index: 0, input: 'qweRtyPPP55', groups: undefined]
// console.log('45qWeRty'.match(/^qwerty/i));  // null

// Перевірити чи dog є окремим словом (\b - перевірить чи є перед і після слова пробільні символи що відділяють слова, рядки, тощо)
// console.log('My dog is cute'.match(/\bdog\b/i));  // ['dog', index: 3, input: 'My dog is cute', groups: undefined]
// console.log('My hotdog is tasty'.match(/\bdog\b/i));  // null

// Шаблонізація символів

// . - вказує один будь який символ (крім нового рядка)

// Перевірити, чи пароль починається на qw і закінчується на ty, посередині між qw та ty має бути два символа
// console.log('qwghty'.match(/^qw..ty$/i));  // ['qwghty', index: 0, input: 'qwghty', groups: undefined]
// console.log('qw888ty'.match(/^qw..ty$/i));  // null

// Перевірити, що рядок містить 7 символів і починається на 111
// console.log('111kiju'.match(/^111....$/i));  // ['111kiju', index: 0, input: '111kiju', groups: undefined]
// console.log('a111kiju888'.match(/^111....$/i));  // null

// Квантифікатори: Вони вказують, скільки разів певний елемент може повторюватися.

// 	+:  Один або більше(нескінченно) разів {1,}.
// 	*:  Нуль або більше разів (нескінченно). {0,}
// 	?:  Нуль або один раз. {0,1}
// 	{n}:  Рівно n разів.
// 	{n,}:  n або більше разів.
// 	{n,m}:  Від n до m разів.

// Перевірити, що рядок містить 7 символів і починається на 111 викоритсовуючи квантифікатори
// console.log('111kiju'.match(/^1{3}.{4}$/i));  // ['111kiju', index: 0, input: '111kiju', groups: undefined]
// console.log('111kiju55'.match(/^1{3}.{4}$/i)); // null

// Розділові знаки та спец.символи в регулярних виразах потрібно обовязково екранізувати за допомогою "\" перед символом (\?)
// виняток символ @ - він не є спеціальним символом і його екранувати не треба
// Спеціальні метасимволи що потребують екранування : ^, $, \, ., *, +, ?, (, ), [, ], {, }, |, /. 
// Символи що не потребують екранування: /, [, ], (, ), {, }, ^, $, |, ?, *, +, ., \ а  також _ та пробіл
//  Усередині символьних класів [...] багато метасимволів (як-от *, +, .) стають звичайними символами і 
// не потребують екранування, окрім \ та ^ (на початку)

// Перевірити, що рядок містить 8 символів і починається з символу "{" після неї має бути 111 викоритсовуючи квантифікатори
// console.log('{111kiju'.match(/^\{1{3}.{4}$/i));  // ['{111kiju', index: 0, input: '{111kiju', groups: undefined]
// console.log('111kiju55'.match(/^1{3}.{4}$/i)); // null

// Перевірити чи відповідає рядок імейлу (будь який рядок що має від 1 о 10 символів далі @ і ще 10 символів)
// console.log('sekfere@dkmfmfm'.match(/^.{1,10}@.{1,10}$/i));  // ['sekfere@dkmfmfm', index: 0, input: 'sekfere@dkmfmfm', groups: undefined]
// console.log('@cdvvv55'.match(/^.{1,10}@.{1,10}$/i));  // null
// console.log('55ssdfd@'.match(/^.{1,10}@.{1,10}$/i));  // null
// console.log('aaa%ddd'.match(/^.{1,10}@.{1,10}$/i));  // null


// Альтернативні символи / один з групи символів

// [0123456789] - В рядку можуть бути тільки цифри, будь яка цифра з переліченихв певній кількості  (+ одна цифра або більше) але тільки цифри
// [0-9] - те саме лиш коротко. В рядку можуть бути тільки цифри, будь яка цифра з перелічених в певній кількості  (+ одна цифра або більше) але тільки цифри
// \d - В рядку можуть бути тільки цифри, будь які цифри в певній кількості  (+ одна цифра або більше) але тільки цифри

// [a-z] - В рядку можуть бути лише маленькі літери від a до z (будь які літери)
// [A-Z] - В рядку можуть бути лише великі літери від A до Z (будь-які літери)
// [a-zA-Z] - В рядку можуть бути лише маленькі та великі літери від a до z та від A до Z (будь-які літери)
// [a-zA-Z0-9_] - Символи слова
// \w - Символи слова - це скоросений запис від [a-zA-Z0-9_]
// ^ - знак заперечення
// ^\d - Не цифра
// \D - Не цифра
// \W - Не символ слова
// ^[q] - не літера q
// \s - пробіл
// \S - не пробіл
// () - використовують для групування або щоб прописати альтернативу (АБО | АБО)
// | - це спец символ "АБО"


// console.log('1234560'.match(/[0123456789]+/));   // ['1234560', index: 0, input: '1234560', groups: undefined]
// console.log('12g4560'.match(/[0123456789]+/));  // ['12', index: 0, input: '12g4560', groups: undefined]
// console.log('12g4560'.match(/^[0123456789]+$/));  // null
// console.log('12g4560'.match(/^[0-9]+$/));  // null
// console.log('1234560'.match(/^\d+$/));  // ['1234560', index: 0, input: '1234560', groups: undefined]

// // Перевірити,що вказано номер телефона у формі +380-2цифри-3цифри-4цифри
// console.log('+380-50-207-0179'.match(/^\+380-[0-9]{2}-[0-9]{3}-[0-9]{4}$/));  // ['+380-50-207-0179', index: 0, input: '+380-50-207-0179', groups: undefined]
// console.log('+380-50-20-70-179'.match(/^\+380-[0-9]{2}-[0-9]{3}-[0-9]{4}$/));  // null
// console.log('+380502070179'.match(/^\+380-[0-9]{2}-[0-9]{3}-[0-9]{4}$/));  // null
// console.log('+380-50-207-0179'.match(/^\+380-\d{2}-\d{3}-\d{4}$/));  // ['+380-50-207-0179', index: 0, input: '+380-50-207-0179', groups: undefined]

// // Перевірити на ім'я (набір символів що починаються з великої букви далі маленькі від 2 до 20 літер)
// console.log('Valerii'.match(/^[A-Z][a-z]{1,19}$/));  // ['Valerii', index: 0, input: 'Valerii', groups: undefined]
// console.log('V'.match(/^[A-Z][a-z]{1,19}$/));  // null
// console.log('VALERII'.match(/^[A-Z][a-z]{1,19}$/));  // null
// console.log('valerii'.match(/^[A-Z][a-z]{1,19}$/));  // null
// console.log('Валера'.match(/^[A-Z][a-z]{1,19}$/));  // null


// // Перевірити, що числовідповідає вигляду 11111.5555 або -11111.5555
// console.log('11111.5555'.match(/^-?\d+\.\d+$/));  // ['11111.5555', index: 0, input: '11111.5555', groups: undefined]
// console.log('-11111.5555'.match(/^-?\d+\.\d+$/));  // ['-11111.5555', index: 0, input: '-11111.5555', groups: undefined]
// console.log('-11111.a555'.match(/^-?\d+\.\d+$/));  // null
// console.log('-1111555'.match(/^-?\d+\.\d+$/));  // null
// console.log('11111*5555'.match(/^-?\d+\.\d+$/)); // null

// // Перевірити що рядок містить або слово cat або слово dog (альтернативні слова)
// // [123] = 1 або 2 або 3
// // (cat|dog) = cat або dog

// console.log('I like cat'.match(/\b(cat|dog)\b/));  // ['cat', 'cat', index: 7, input: 'I like cat', groups: undefined]
// console.log('I like cat or dog'.match(/\b(cat|dog)\b/));  // ['cat', 'cat', index: 7, input: 'I like cat', groups: undefined]


// // Перевірити що рядок містить або слово cat або слово dog (альтернативні слова) в однині абов  множині cats або dogs
// console.log('I like cats'.match(/\b(cat|dog)s?\b/));  // ['cats', 'cat', index: 7, input: 'I like cats', groups: undefined]
// console.log('I like cat'.match(/\b(cat|dog)s?\b/));  //  ['cat', 'cat', index: 7, input: 'I like cat', groups: undefined]

// // Перерити складного міені "Anna-Mariia" але друге імя може бути а може і не бути
// console.log('Anna-Mariia'.match(/[A-Z][a-z]{1,19}(-[A-Z][a-z]{1,19})?/));  // ['Anna-Mariia', '-Mariia', index: 0, input: 'Anna-Mariia', groups: undefined]
// console.log('Anna-mariia'.match(/[A-Z][a-z]{1,19}(-[A-Z][a-z]{1,19})?/));  // ['Anna', undefined, index: 0, input: 'Anna-mariia', groups: undefined]
// console.log('AnnaMariia'.match(/^[A-Z][a-z]{1,19}(-[A-Z][a-z]{1,19})?$/));  // null
// console.log('Anna'.match(/[A-Z][a-z]{1,19}(-[A-Z][a-z]{1,19})?/));  // ['Anna', undefined, index: 0, input: 'Anna', groups: undefined]

// // Перевірити номер телефону на формат +380-50-207-0179 або +380-50-207-01-79
// console.log('+380-50-207-0179'.match(/^\+380-\d{2}-\d{3}-(\d{4}|\d{2}-\d{2})$/)); // ['+380-50-207-0179', '0179', index: 0, input: '+380-50-207-0179', groups: undefined]
// console.log('+380-50-207-01-79'.match(/^\+380-\d{2}-\d{3}-(\d{4}|\d{2}-\d{2})$/)); //  ['+380-50-207-01-79', '01-79', index: 0, input: '+380-50-207-01-79', groups: undefined]
// console.log('+380-50-207-01-79'.match(/^\+380-\d{2}-\d{3}(-\d{2}){2}$/)); //  ['+380-50-207-01-79', '-79', index: 0, input: '+380-50-207-01-79', groups: undefined]

// // Перевірити номер телефону на формат +380-50-207-0179 або +380-50-207-01-79 а також визначити що код оператора має бути не 
// // довільним а одним з перерахованих!

// console.log('+380-50-207-0179'.match(/^\+380-(99|98|97|96|95|73|50|67|68|63|93)-\d{3}-(\d{4}|\d{2}-\d{2})$/));  // ['+380-50-207-0179', '50', '0179', index: 0, input: '+380-50-207-0179', groups: undefined]
// console.log('+380-98-207-0179'.match(/^\+380-(99|98|97|96|95|73|50|67|68|63|93)-\d{3}-(\d{4}|\d{2}-\d{2})$/));  // ['+380-98-207-0179', '98', '0179', index: 0, input: '+380-98-207-0179', groups: undefined]
// console.log('+380-98-207-01-79'.match(/^\+380-(99|98|97|96|95|73|50|67|68|63|93)-\d{3}-(\d{4}|\d{2}-\d{2})$/));  // ['+380-98-207-01-79', '98', '01-79', index: 0, input: '+380-98-207-01-79', groups: undefined]
// console.log('+380-00-207-0179'.match(/^\+380-(99|98|97|96|95|73|50|67|68|63|93)-\d{3}-(\d{4}|\d{2}-\d{2})$/));  // ['+380-98-207-0179', '98', '0179', index: 0, input: '+380-98-207-0179', groups: undefined]


// Жадібний режим квантифікаторів (з країв шукаємо а в середині все зжеремо)
// тобто жадібний режим означає, що у виразі /".*"/g) пошук починається з /". - шукає з початку рядка лапку і після нього будь-які символи
// далі починає пошук з кінця "/ - шукає в кінці рядка закриваючу лапку
// а все що в середині * - пропускає, тому на виході ми отримаємо "yes", but thhought and then said "no" замість "yes" та "no"
// Щоб виключити жадібний режим квантифікатора * і включити режим лінивого квантифікатора (перевіряти від початку рядка до кінця) 
// потрібно після квантифікатора поставити знак питання ?
// Знак питання в регулярних виразах має дві ролі:
// 1. Якщо він стоїть одразу після символа (літери чи значка що позначає будь який символ) то він працює як квантифікатор (0 або 1 раз)
// 2. Якщо він стоїть після іншого квантифікатора то він переводить цей квантифікатор з Жадібного режиму(за умовчуванням) в Лінивий режим

//Знайти цитати
// console.log('I said "yes", but thhought and then said "no"'.match(/".*"/g));  // ['"yes", but thhought and then said "no"']
// console.log('I said "yes", but thhought and then said "no"'.match(/".*?"/g));  // ['"yes"', '"no"']

// // Виокремити речення (маячком початку речення є велика літера, маячком кінця речення є крапка)
// // 'Flmvlfc dklcldscms smclkdmcc. Jdbsgdcd dhbds sdvscbdh.'
// console.log('Flmvlfc dklcldscms smclkdmcc. Jdbsgdcd dhbds sdvscbdh.'.match(/[A-Z].*\./g));  // ['Flmvlfc dklcldscms smclkdmcc. Jdbsgdcd dhbds sdvscbdh.']
// console.log('Flmvlfc dklcldscms smclkdmcc. Jdbsgdcd dhbds sdvscbdh.'.match(/[A-Z].*?\./g));  // ['Flmvlfc dklcldscms smclkdmcc.', 'Jdbsgdcd dhbds sdvscbdh.']

// // Виокремити з рядка грошові одиниці
// console.log('djjd 10.00$ fkfjfkdmsm 5530.50$ kdjencc'.match(/\d.*\$/g));  // ['10.00$ fkfjfkdmsm 5530.50$']
// console.log('djjd 10.00$ fkfjfkdmsm 5530.50$ kdjencc'.match(/\d.*?\$/g));  // ['10.00$', '5530.50$']



// Випереджальні та ретроспективні перевірки (Позитивна випереджаюча перевірка) (Look ahead and look behind)
// В еяких випадках нам необхідно знайти відповідність шаблону, але тільки тому, після яких чи перед якими йде інший шаблон
// Для цього в регулярних виразах є сспец синтаксис : Випереджальна(Look ahead) та ретроспективна(lookbehind) перевірка.

// Додаткові умови в регулярних виразах (які перевіряють на якусь умову але не включають її в результат)

// 1. Випереджальна перевірка
// Синтаксис X(?=Y), тобто знайди X після яйого стоїть Y. Замість X та Y можна підставляти будь який шаблон

// Виокремити ціну з рядка (тобто отримати число біля якого є відповідний значок валюти але при цьому не витягувати цей значок)
// console.log('Hkdcd 10$ per 5 pcs'.match(/\d+\$/g));  // ['10$'] - так витягується і сума і значок валюти
// console.log('Hkdcd 10$ per 5 pcs'.match(/\d+(?=\$)/g));  // ['10'] - так витягується лише сума завдяки дод умові (?=\$)

// 2. Негативна випереджальна перевірка
// Синтаксис X(?!Y), тобто знайди X після якого НЕ стоїть Y. Замість X та Y можна підставляти будь який шаблон
// console.log('Hkdcd 10$ per 5 pcs'.match(/\d+(?!\$)/g));  // ['1', '5']
// console.log('Hkdcd 10$ per 5 pcs'.match(/\d+\b(?!\$)/g)); // ['5'] - додати межу слова \b щоб не роділяти число на цифри(взяти ціле число після якого НЕ стоть знак $)
// console.log('2 індички коштують 60€'.match(/\d+\b(?!€)/g));  // ['2']

// 3. Перевірка назад (з заду на перед)(ретроспективна перевірка)
// Перевірка назад не підтримується в браузерах з відміннимим від V8 двигунами, зокрема Safari, Internet Explorer.
// Синтаксис (?<=Y)X, тобто знайди X перед яким стоїть Y. Замість X та Y можна підставляти будь який шаблон
// console.log('Hkdcd $10 per 5 pcs'.match(/\$\d+/g));  // ['$10'] - так витягується і сума і значок валюти
// console.log('Hkdcd $10 per 5 pcs'.match(/(?<=\$)\d+/g));  // ['10'] - так витягується лише сума завдяки дод умові (?<=\$)

// 4. Негативна перевірка назад (з заду на перед) (ретроспективна негативна перевірка)
// Синтаксис (?<!Y)X, тобто знайди X перед яким не стоїть Y. Замість X та Y можна підставляти будь який шаблон
// console.log('Hkdcd $10 per 5 pcs'.match(/(?<!\$)\d+/g));  // ['0', '5'] - якщо не встановити межу слова то потягне 0 від 10 і 5 шт
// console.log('Hkdcd $10 per 5 pcs'.match(/(?<!\$)\b\d+/g)); // ['5'] - додати межу слова \b щоб не роділяти число на цифри(взяти ціле число перед яким НЕ стоть знак $)
// console.log('2 індички коштують €60'.match(/(?<!€)\b\d+/g));  // ['2']

// Регулярні вирази часто використовуюьтся при перевірці валідності пароля з питань безпеки, наприклад якщо нам потрібно, щоб пароль містив
// великі символи, маленькі символи, цифри, якийсь розділовий знак, мав певну довжину тощо

// Приклад перевіримо чи пароль відповідає такому шаблону (враховуючи що ми наперед неможемо знати в якому саме порядку будуть розташовані символи)
// Шаблон пароля: довжина від 8 до 16 символів. Має містити обовязково: хоча б одну Вел.літеру, мал. літери, 
// цифру, один з цих символів (!@#$%^&*.) - Qq1.gggg

// console.log('Qq1.ggabc'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // ['Qq1.ggabc', index: 0, input: 'Qq1.ggabc', groups: undefined]
// console.log('Qq1.gg'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо довжина пароля не від 8 до 16 символів
// console.log('Qq1fggbc'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо нема спецсимвола
// console.log('qq1.ggbc'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо нема вел літер
// console.log('Qqk.ggbc'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо нема цифри
// console.log('QQ1.QQBC'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо нема мал літери
// console.log('qqw1&ABC'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // ['qqw1&ABC', index: 0, input: 'qqw1&ABC', groups: undefined]
// console.log('qqw1&ABCllssspppaaaxdmxclckdmjdn!skks'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*).{8,16}$/));  // null - якщо більше ніж 16 символів 
// console.log('qqw1&ABCqwerty'.match(/^(?=.*[A-Z].*)(?=.*[a-z].*)(?=.*\d.*)(?=.*[!@#$%^&*.].*)(?!.*[qwerty].*).{8,16}$/));  // null - щоб пароль не містив qwerty 


// Регулярні вирази в методах JS (split, replace)

// //Приклад: Прибрати з рядка купи багато пробілів і замінити їх на один пробіл

// const str1 = 'Aknfkjdnc      ckldnk   kcldmwlv      ldqkckmnlwvl';
// const str1Res = str1.replace(/\s{2,}/g, ' ');
// console.log(str1Res);  // Aknfkjdnc ckldnk kcldmwlv ldqkckmnlwvl

// // Приклад: Прибрати ненормативну лексику з повідомлень (fuck, ass, asshole, bitch) на "!@#$"

// const str2 = 'I hate you asshole bitchy person! Fuckkkkkk you!))))';
// const str2Res = str2.replace(/(fuck|ass|asshole|bitchy)\b/gi, '!@#$');
// console.log(str2Res);  // I hate yoyu !@#$ !@#$y person! !@#$ you!))))

// const str3Res = str2.replace(/(f+u+c+k|a+s+s|a+s{2,}h+o+l+e|b+i+t+c+h+y+)/gi, '###');
// console.log(str3Res);  // I hate you ### ### person! ### you!))))

// // Приклад : Прибрати з рядка купи багато пробілів і замінити їх на один пробіл
// const str4 = 'Aknfkjdnc      ckldnk   kcldmwlv      ldqkckmnlwvl';
// const str4Res = str4.split(/\s{1,}/g);
// console.log(str4Res);   //  ['Aknfkjdnc', 'ckldnk', 'kcldmwlv', 'ldqkckmnlwvl']

// // Приклад : Розділити дату (1990/12/12, 1990.12.12, 1990-12-12) на масив Рік Місяць День
// // Порядодк дати визначений, а роздільником може бути будь який символ

// const str5 = '1990/12/12';
// const str5Res = str5.split(/[/.-]/g);
// const str5Res1 = str5.split(/-|\/|\./g);
// console.log(str5Res);   // ['1990', '12', '12']
// console.log(str5Res1);   // ['1990', '12', '12']