'use strict';
                    
                    // Суворий режим та var (Strict mode and var)


                    // https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Strict_mode
                    // https://www.w3schools.com/js/js_strict.asp#
                    // https://uk.javascript.info/strict-mode
                    // https://uk.javascript.info/var

// JS до 2015р. До прийняттяEcmaScript 6

// оголошення змінної без оголошення змінної
// a = 5;  // без cost чи let

// // оскільки поняття області видимості було відсутнє, то при обявленні функції значення змінних а перезатирались
// function f() {
//     a = 10;
// }
// console.log(a);
// console.log(f);

// це призвело до великих проблем з областями видимості,  з затиранням даних в змінних, будь яку вбудовану функцію типу alert, consolelog тощо в глобальній області видимості window можн абуло перевизначити що призводило до проблем 
// тому пізніше ввели змінну var - вона не вирішила всіх проблем, але все таки дала певні покращення
// зявилось поняття області видимості і змінна а в глобальній області видимості це НЕ змінна а в локальній області видимості (що у середину функції)

// var a = 5; 

// function f() {
//     var a = 10;  
// }
// console.log(f);
// console.log(a);

// // але попри появу локальної області видимості, не було блочної області видимості (все що не функції, напр if)

// if (true) {
//     var a = 15;  // Global scope - після виконання наш а з глобальної області видимості перезатерлося і = 15 а не 5
// }

// // ще була проблема що якщо викликати змінну перед її оголошенням то все норм відпрацьовувало просто повертало undefined (це називається підняття змінних)

// console.log(b);  // undefined
// var b = 1;
// console.log(b);  // 1

// підсумок:
// + local scope
// - block scope
// - підняття змінних



// JS після 2016р. Після прийняття EcmaScript 6
// ввели змінні let та const замість var, чим обмежили імовірність виникнення всяких непередбачуваних реакції коду і довели його до стандарту з яким ми зараз працюємо
// але ввести їх строго зразу неможна було, тому що скрипти написані за старим стандартом поваллись би
// тому з ES6 дали змогу "включити" ці зміни за допомогою Суворого режиму Strict mode 
// для того щоб його включити потрібно в найпершому рядку скрипта (або фукції) написати 'use strict';

// неможливо отримати змінну до її оголошення

// console.log(c);  // Cannot access 'c' before initialization
// const c = 2;
// console.log(c);  // ця частина коду не виконується через помилку в попередньому консоль лозі

// 'use strict';  
// const n = 10;
// n.name = 100;  // Cannot create property 'name' on number '10'


// генерує помилки для моментів які некоректні, раніше цього не було

// у функцій this є window, тому без стрікта можна було у функції випадково затерти якісь властивості у window
// тому у стрікт прибрали у функції. Зникли певні проблеми з функціями-конструкторами
// наприклад функцію конструктор неможна викликати без кодового слова new

// function F() {

// }
// const t = new F();  // F {}
// const m = F();  // undefined