                // ES6 Modules

// https://uk.javascript.info/modules

// ES6 Modules (або ECMAScript Modules / ESM) — це офіційний, вбудований у JavaScript механізм, 
// який дозволяє розбивати один великий файл коду на менші, незалежні шматочки (модулі).

// Простіше кажучи: це як конструктор LEGO. Замість того, щоб писати весь код сайту в одному величезному файлі на 5000 рядків, 
// ти створюєш окремі файли: один суто для функцій пошуку, другий — для створення нотаток, третій — для поп-апів. 
// А потім просто «склеюєш» їх між собою за допомогою спеціальних команд export та import.

// Сьогодні це стандарт у веброзробці. Його використовують:
// У сучасних браузерах — щоб підключати JS-файли безпосередньо.
// У сучасних фреймворках (React, Vue, Angular) — там взагалі весь код побудований на модулях.
// У Node.js (бекграунд) — для створення серверних додатків.

// Підключаємо модулі напряму в браузері через HTML, але звичайний тег <script> не спрацює. 
// Якщо просто написати src="app.js", браузер видасть помилку: Cannot use import statement outside a module.
// Щоб браузер зрозумів, що це модуль, йому потрібно обов'язково вказати атрибут type="module":
// <script type="module" src="js/app.js"></script>
// При цьому defer зашитий автоматично в type-module
// І режим use strict теж зашитий автоматом в type-module. Їх додатково прописувати нетрба.

// Важливий нюанс: У HTML-файлі ти підключаєш тільки один головний файл (наприклад, app.js). 
// Усі інші файли (як-от math.js) підключати в HTML через тег <script> не треба — головний файл 
// сам імпортує їх через JS-команду import.

// Щоб модулі працювали, використовуються два ключових слова:
// export — виставляє функцію, змінну чи клас "назовні", робить її доступною для інших файлів.
// import — затягує потрібну функцію з іншого файлу до себе.

// Наприклад:
// У мене є файл math.js (тут ми щось створюємо і експортуємо):
// // Файл: math.js
// export function add(a, b) {
//     return a + b;
// }

// І є мій головний файл app.js (тут ми це імпортуємо):
// // Файл: app.js
// import { add } from './math.js'; // Зверни увагу на крапку і слеш (шлях до файлу)

// console.log(add(2, 3)); // Виведе: 5

// Три основні переваги модулів:
// Ізоляція коду (Власна область видимості): Змінні, створені всередині одного модуля, "живуть" тільки там. 
// Вони не змішуються з іншими файлами і не створюють хаосу в глобальній пам'яті сайту. 
// Тобі більше не треба переживати, що в різних файлах ти випадково назвеш змінні однаково.

// Автоматичний defer: Модулі за замовчуванням завантажуються асинхронно (як під капотом із властивістю defer). 
// Це означає, що скрипт не блокуватиме завантаження HTML-сторінки, навіть якщо ти підключиш його в самому 
// верху сторінки, в тегу <head>.

// Строгий режим ("use strict"): Усі модулі автоматично працюють у строгому режимі JavaScript. 
// Це захищає тебе від дурних помилок (наприклад, JS не дозволить створити змінну без ключового слова const 
// чи let).