// 1. іменований імпорт  

// 1.1 імпортуємо функцію sum з : шлях до іншого файлу де лежить функція sum
// коли імпортуємо то огортаємо фукцію в {}, наче робимо детруктуризацію обєкта
// в цьому синтаксисі ми можемо не імпортувати все що є в math ми можемо імпортувати 
// тільки необхідні файли.
// import {sum, mult, PI} from './math.js';

// console.log(sum(1, 2));  // 3

// console.log(mult(PI, 2));  // 6.28  - тут PI це теж з модуля

// Щоб перейменувати на льоту назву змінної яку імпортуємо НЕ можна використовувати 
// синтаксис як при деструктуризації обєктів, хоча тут все виглядає як обєкт. Для 
// перейменування є спеціальне ключове слово as:

// import {sum as mySum, mult as myMult, PI as superPI} from './math.js';

// після перейменування в файлі math.js назви не зміняться! Там залишиться sum mult PI
// а в цьому файлі main.js (в цій області видимості) використовуємо нові назви 
// mySum myMult superPI

// є ще один синтаксис для іменованого імпорту який НЕ дозволяє імпортувати по 
// частинам, а лише групою все що містить файл який вказаний у from

// 1.2 імпортуємо все що є у math.js і назвемо це все MyMath
// import * as MyMath from './math.js';

// щоб використати імпортоване, просто звертаємось до нього через крапкову нотацію,
// як зі звичайними обєктами
// console.log(MyMath.sum(1,3));  // 4

// Якщо ми виведемо свм модуль то отримаємо обєкт з методами і властивостями які 
// ми в ньому створили та з геттерами сеттерами до кожного з них, при цьому методи не
// мають прототипу. Прототипи мають лише геттери і сеттери.
// console.log('MyMath :>> ', MyMath);
// MyMath :>>  Module {Symbol(Symbol.toStringTag): 'Module'}
// PI:(...)
// mult:(...)
// sum:(...)
// Symbol(Symbol.toStringTag):"Module"
// get PI:ƒ ()
// set PI:ƒ ()
// get mult:ƒ ()
// set mult:ƒ ()
// get sum:ƒ ()
// set sum:ƒ ()


// 2. Дефолтний імпорт - назва може бути хоть яка, і таким чином ми за дефолтом імпортуємо
// клас Test тому що в math.js він експортується по дефолту. На відміну від п.1.2. де ми збираємо 
// все все що нам дає math.js і перейменовуємо, то тут збирати нетреба, тут ми просто отримуємо
// готовий дефолтний клас і зразу даємо йому назву

// import MyClass from './math.js';
// console.log(new MyClass(5));  // Test {tmp: 5}


// 3. Змішаний імпорт (1 дефолтний багато іменованих)

// MyTest - це те що прописано в math.js як дефолтний експорт
// sum, mult, PI} - те що прописано в math.js як іменований експорт
import MyTest, {sum, mult, PI} from './math.js';

console.log('new MyTest :>(13)> ', new MyTest(13));  // Test {tmp: 13}
console.log('sum :>(10,10)> ', sum(10,10));  // 20
console.log('mult(5,5) :>> ', mult(5,5));  // 25

// Для змішаного імпорту є один нюанс, - вище це був зручніший синтаксис
// але насправді в іменованому імпорті отут {sum, mult, PI} є завжди приховане
// зарезервоване місце для default отак {default as MyTest, sum, mult, PI}
// оскільки тут ми працюємо за правилами деструктуризації, то порядок немає значення
// цей default можна прописати в будь якому місці, не обовязково першим чи останнім
// тобто змішаний імпорт можна виконати за допомогою іменованого імпорта отак

import {default as MyTest, sum, mult, PI} from './math.js';

// але краще виносити дефолт за межі дужок, так краще читати!