// 1іменоваий експорт

// 1.1 варіант - це оголошувати кожну властивість кремо з ключовим словом export
export const sum = (a, b) => a + b; 

// те що ми отримаємо від цієї функції буде виглядати як обєкт, приблизно так:
// {
//     sum: (a, b) => a + b; 
// }

// таких функцій тут може бути декілька, тоді в обєкт який ми отримуємо при імпорті
// додається нова властивість.

export const mult = (a, b) => a * b; 

// тепер обєкт буде виглядати так:
// {
//     sum: (a, b) => a + b; 
//     mult: (a, b) => a * b;
// }

// таким чином ми можемо виносити в модулі і передавати будь які типи даних, функції, тощо
export const PI = 3.14; 

// тепер обєкт буде виглядати так:
// {
//     sum: (a, b) => a + b; 
//     mult: (a, b) => a * b;
//     PI: 3.14;
// }

// 1.2 варіант - це оголосити всі властивості кремо а потім
// ключовим словом export дозволиити передавати всі оголошені змінні
// const sum = (a, b) => a + b; 
// const mult = (a, b) => a * b; 
// const PI = 3.14;
// export {sum, mult, PI};


// 2. Дефолтний експорт

// В одному файлі .js може бути тільки один export default. Це залізне правило JavaScript.

class Test {
    constructor(tmp) {
        this.tmp = tmp;
    }
}

export default Test;

